app/controllers/reviews_controller.rb

	def update
		@review = Review.find(params[:id])
		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reviews" SET "name" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["name", "Dave Reece"], ["updated_at", "2015-11-25 18:34:45.146322"]]